//Задание
//
//Магические квадраты издавна интриговали воображение людей:
//дата изготовления древнейшей сохранившейся таблицы относится к 2200 г.
//До н.э. Магический квадрат – это квадратная таблица размера n х n,
//составленная из всех чисел 1, 2, 3 … n2 таким образом, что суммы по
//каждому столбцу, каждой строке и каждой диагонали равны между собой.
//Напишите программу (используя классы), которая определяет, можно ли
//считать матрицу магическим квадратом.

public class MagicSquare{
   //body
}
